
var Demos = {

    "CSS 样式库": {

        url: "",
        
        sub: {
            "基本结构": {

                url: "",

            }
        }

    },

    "表单": {

        sub: {

            "表单": {

            },

            "文本框": {

            }

        }

    },

    "按钮": {
        
        sub: {

            "按钮": {

            },

            "按钮组": {

            },

            "下拉按钮": {

            },

            "分隔按钮": {

            }

        }

    }

};
